//featuresDictionary.js
export const featuresDictionary = {
    NOUN: {
        Case: {
          label: "Жондомосу",
          values: {
            Nom: "Атооч",    // Именительный
            Gen: "Илик",     // Родительный
            Dat: "Барыш",    // Дательный
            Acc: "Табыш",    // Винительный
            Loc: "Жатыш",    // Местный
            Abl: "Чыгыш",    // Исходный
          },
        },
        Number: {
          label: "Саны",
          values: {
            Sing: "Жекелик сан",  // Единственное
            Plur: "Көптүк сан",   // Множественное
            X: "Саналбаган", //Саналбаган
          },
        },
        Poss: {
          label: "Таандык",
          values:{
            Yes: "Таандык з.а",
            No: "Таандык эмес з.а"
          }
        }
        
    },
    PRON: {
        Case: {
          label: "Жондомосу",
          values: {
            Nom: "Атооч",  // Именительный
            Gen: "Илик",   // Родительный
            Dat: "Барыш",  // Дательный
            Acc: "Табыш",  // Винительный
            Loc: "Жатыш",  // Местный
            Abl: "Чыгыш",  // Исходный
          },
        },
        Number: {
          label: "Саны",
          values: {
            Sing: "Жекелик сан",  // Единственное
            Plur: "Көптүк сан",   // Множественное
          },
        },
        PronType: {
            label: "Ат атоочтун түрү",
            values: {
                Prs: "Жактама ат атооч", //Пример: мен, сен, ал, биз, силер, алар
                Dem: "Шилтеме ат атооч", //Пример: бул, тиги, ушул
                Int: "Сурама ат атооч", //Пример: ким, эмне, кайсы, канча, кайдан, кандай
                Neg: "Таңгыч ат атооч", //Пример: эч ким, эч нерсе, эч бир
                Def: "Аныктама ат атооч", //Пример: бүткүл, бардык, ар ким, ар бир, өз
                Ind: "Белгисиз ат атооч", //Пример: кайсы кимдир бирөө, алда кандай, бир нерсе, кай бир
            }
        }
    },
    PROPN:  {
        Case: {
          label: "Жондомосу",
          values: {
            Nom: "Атооч",    // Именительный
            Gen: "Илик",     // Родительный
            Dat: "Барыш",    // Дательный
            Acc: "Табыш",    // Винительный
            Loc: "Жатыш",    // Местный
            Abl: "Чыгыш",    // Исходный
          },
        },
        Number: {
          label: "Саны",
          values: {
            Sing: "Жекелик сан",  // Единственное
            Plur: "Көптүк сан",   // Множественное
          },
        }
    },
    ADJ: {
        Degree: {
          label: "Даражасы",
          values: {
            Pos: "Жай даража",    // Положительная степень (обычный)
            Comp: "Салыштырма жаража",       // Сравнительная степень (более)
            Superl: "Күчөтмө даража", // Превосходная степень (самый)
          },
        },
        Form:{
          label: "Жасалышы боюнча болунушу",
          values: {
            A: "Катыштык", 
            B: "Сыпаттык"
          }
        }
    },
    NUM:{
        NumType:{
            label: "Сан атоочтун түрү",
            values:{
                Card: "Эсептик сан", //Примеры: "Он", "Жыйырма", "Кырк", "Эки жүз", "Миллион".
                Ord: "Иреттик сан", //Примеры: "Биринчи", "Экинчи", "Үчүнчү", "Жыйырманчы".
                Set: "Жамдама сан", //Примеры: "Бирөө", "Экөө", "Үчөө", "Төртөө", "Бешөө", "Алтоо", "Жетөө".
                App: "Чамалама сан", //Примеры: "Ондой", "Жыйырмача", "Кырктай", "Жүзгө жакын", "Отуз чакты".
                Mult: "Топ сан", //Примеры: "Үч — үчтөн", "Беш — алтыдан", "Отуз — кырктан".
                Frac: "Бөлчөк сан", //римеры: "Экиден бир", "Бештен үч", "Сегиз бүтүн ондон бир".
            }
        }
    }, 
    VERB: {
        Tense: {
          label: "Чагы",
          values: {
            Pres: "Учур чак",  // Настоящее
            Past: "Өткөн чак",   // Прошедшее
            Fut: "Келээр чак",  // Будущее
          },
        },
        Person: {
          label: "Жагы",
          values: {
            "1": "Биринчи жак",  // Первый
            "2": "Экинчи жак",   // Второй
            "3": "Үчүнчү жак",   // Третий
          },
        },
        Number: {
          label: "Саны",
          values: {
            Sing: "Жекелик сан",  // Единственное
            Plur: "Көптүк сан",   // Множественное
          },
        },
        Mood: {
          label: "Ыңгайлары",
          values: {
            Imp: "Буйрук ыңгай",       
            Cnd: "Шарттуу ыңгай", 
            Pot: "Максат-ниет ыңгай",
            PotDes: "Каалоо-тилек ыңгай",
            Ind: "Баяндагыч ыңгай"
            },
        },
        Polarity:{
            label: "Формасы",
            values: {
                Neg: "Терс форма",
                Pos: "Оң форма"
            }
        },
        Voice:{
            label: "Мамилелери",
            values:{
                Act: "Негизги мамиле",
                Rcp: "Кош мамиле",
                Mid: "Өздүк мамиле",
                Pass: "Туюк мамиле", 
                Cau: "Аркылуу мамиле"
            }
        },
        VerbForms: {
          label: "Озгочо формасы",
          values: {
            B: "Чакчыл",
          }
        }
    },
    ADV:{
      Form:{
        label: "Туру",
        values: {
          A: "Мезгил бышыктагыч", 
          B: "Орун бышыктагыч", 
          C: "Сын сыпат аныктагыч", 
          D: "Сан олчом аныктагыч"
        }
      }
    },
    ATOOCH:{
      Case: {
        label: "Жондомосу",
        values: {
          Nom: "Атооч",    // Именительный
          Gen: "Илик",     // Родительный
          Dat: "Барыш",    // Дательный
          Acc: "Табыш",    // Винительный
          Loc: "Жатыш",    // Местный
          Abl: "Чыгыш",    // Исходный
        },
      },
      Number: {
        label: "Саны",
        values: {
          Sing: "Жекелик сан",  // Единственное
          Plur: "Көптүк сан",   // Множественное
        },
      },
      Poss: {
        label: "Таандык",
        values:{
          Yes: "Таандык ",
          No: "Таандык эмес "
        }
      }
    },
    KTOOCH:{
      Case: {
        label: "Жондомосу",
        values: {
          Nom: "Атооч",    // Именительный
          Gen: "Илик",     // Родительный
          Dat: "Барыш",    // Дательный
          Acc: "Табыш",    // Винительный
          Loc: "Жатыш",    // Местный
          Abl: "Чыгыш",    // Исходный
        },
      },
      Number: {
        label: "Саны",
        values: {
          Sing: "Жекелик сан",  // Единственное
          Plur: "Көптүк сан",   // Множественное
        },
      },
      Poss: {
        label: "Таандык",
        values:{
          Yes: "Таандык ",
          No: "Таандык эмес "
        }
      }
    }
};